#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.network.data.aws_region.current: Reading...
module.server.data.aws_iam_policy_document.ec2_policy: Reading...
module.server.data.aws_caller_identity.current: Reading...
module.app_bucket.data.aws_caller_identity.current: Reading...
module.server.data.aws_iam_policy_document.ec2_policy: Read complete after 0s [id=2851119427]
module.network.data.aws_region.current: Read complete after 0s [id=ap-southeast-4]
module.server.data.aws_caller_identity.current: Read complete after 1s [id=494557546769]
module.app_bucket.data.aws_caller_identity.current: Read complete after 1s [id=494557546769]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.app_bucket.aws_kms_key.s3_kms will be created
  + resource "aws_kms_key" "s3_kms" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 20
      + description                        = "S3 symmetric encryption KMS key"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = (known after apply)
    }

  # module.app_bucket.aws_kms_key_policy.s3_kms_policy will be created
  + resource "aws_kms_key_policy" "s3_kms_policy" {
      + bypass_policy_lockout_safety_check = false
      + id                                 = (known after apply)
      + key_id                             = (known after apply)
      + policy                             = jsonencode(
            {
              + Id        = "key-s3-example-default-policy"
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::494557546769:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.app_bucket.aws_s3_bucket.app_files will be created
  + resource "aws_s3_bucket" "app_files" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "example-default-app-files"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
          + "Application" = "example"
          + "Created_By"  = "Terraform"
          + "Description" = "Wordpress website hosted in EC2"
          + "Environment" = "default"
          + "Name"        = "example-default"
          + "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"        = "Business"
        }
      + tags_all                    = {
          + "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
          + "Application" = "example"
          + "Created_By"  = "Terraform"
          + "Description" = "Wordpress website hosted in EC2"
          + "Environment" = "default"
          + "Name"        = "example-default"
          + "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"        = "Business"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.app_bucket.aws_s3_bucket_acl.app_files_acl will be created
  + resource "aws_s3_bucket_acl" "app_files_acl" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

  # module.app_bucket.aws_s3_bucket_logging.bucket_logging will be created
  + resource "aws_s3_bucket_logging" "bucket_logging" {
      + bucket        = (known after apply)
      + id            = (known after apply)
      + target_prefix = "log/"
        # (1 unchanged attribute hidden)
    }

  # module.app_bucket.aws_s3_bucket_notification.bucket_notification will be created
  + resource "aws_s3_bucket_notification" "bucket_notification" {
      + bucket      = (known after apply)
      + eventbridge = false
      + id          = (known after apply)

      + topic {
          + events        = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix = "logs/"
          + id            = (known after apply)
          + topic_arn     = (known after apply)
        }
    }

  # module.app_bucket.aws_s3_bucket_public_access_block.app_files_block will be created
  + resource "aws_s3_bucket_public_access_block" "app_files_block" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.app_bucket.aws_s3_bucket_server_side_encryption_configuration.app_files_encryption will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "app_files_encryption" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = (known after apply)
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.app_bucket.aws_s3_bucket_versioning.app_files_versioning will be created
  + resource "aws_s3_bucket_versioning" "app_files_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.app_bucket.aws_sns_topic.bucket_notifications will be created
  + resource "aws_sns_topic" "bucket_notifications" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = "alias/aws/sns"
      + name                        = "example-default-app-files-notifications"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.dns.data.aws_route53_zone.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_route53_zone" "this" {
      + arn                        = (known after apply)
      + caller_reference           = (known after apply)
      + comment                    = (known after apply)
      + id                         = (known after apply)
      + linked_service_description = (known after apply)
      + linked_service_principal   = (known after apply)
      + name                       = "example.com"
      + name_servers               = (known after apply)
      + primary_name_server        = (known after apply)
      + resource_record_set_count  = (known after apply)
      + tags                       = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)
    }

  # module.dns.aws_route53_record.ipv4 will be created
  + resource "aws_route53_record" "ipv4" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "example.com"
      + type            = "A"
      + zone_id         = (known after apply)

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.dns.aws_route53_record.www will be created
  + resource "aws_route53_record" "www" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www"
      + records         = [
          + "example.com",
        ]
      + ttl             = 600
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # module.server.aws_iam_instance_profile.wp_ec2 will be created
  + resource "aws_iam_instance_profile" "wp_ec2" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "example-default-instance-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "example-default-ec2-role"
      + tags        = {
          + "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
          + "Application" = "example"
          + "Created_By"  = "Terraform"
          + "Description" = "Wordpress website hosted in EC2"
          + "Environment" = "default"
          + "Name"        = "example-default"
          + "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"        = "Business"
        }
      + tags_all    = {
          + "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
          + "Application" = "example"
          + "Created_By"  = "Terraform"
          + "Description" = "Wordpress website hosted in EC2"
          + "Environment" = "default"
          + "Name"        = "example-default"
          + "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"        = "Business"
        }
      + unique_id   = (known after apply)
    }

  # module.server.aws_iam_role.wp_ec2 will be created
  + resource "aws_iam_role" "wp_ec2" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "example-default-ec2-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
          + "Application" = "example"
          + "Created_By"  = "Terraform"
          + "Description" = "Wordpress website hosted in EC2"
          + "Environment" = "default"
          + "Name"        = "example-default"
          + "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"        = "Business"
        }
      + tags_all              = {
          + "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
          + "Application" = "example"
          + "Created_By"  = "Terraform"
          + "Description" = "Wordpress website hosted in EC2"
          + "Environment" = "default"
          + "Name"        = "example-default"
          + "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"        = "Business"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.server.aws_iam_role_policy_attachment.wp_ec2_policy_s3 will be created
  + resource "aws_iam_role_policy_attachment" "wp_ec2_policy_s3" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonS3FullAccess"
      + role       = "example-default-ec2-role"
    }

  # module.server.aws_iam_role_policy_attachment.wp_ec2_policy_ssm will be created
  + resource "aws_iam_role_policy_attachment" "wp_ec2_policy_ssm" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMReadOnlyAccess"
      + role       = "example-default-ec2-role"
    }

  # module.server.aws_instance.wp_ec2 will be created
  + resource "aws_instance" "wp_ec2" {
      + ami                                  = "ami-02a66f06b3557a897"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = true
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "example-default-instance-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = true
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
          + "Application" = "example"
          + "Created_By"  = "Terraform"
          + "Description" = "Wordpress website hosted in EC2"
          + "Environment" = "default"
          + "Name"        = "example-default"
          + "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"        = "Business"
        }
      + tags_all                             = {
          + "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
          + "Application" = "example"
          + "Created_By"  = "Terraform"
          + "Description" = "Wordpress website hosted in EC2"
          + "Environment" = "default"
          + "Name"        = "example-default"
          + "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"        = "Business"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + volume_tags                          = {
          + "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
          + "Application" = "example"
          + "Created_By"  = "Terraform"
          + "Description" = "Wordpress website hosted in EC2"
          + "Environment" = "default"
          + "Name"        = "example-default"
          + "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"        = "Business"
        }
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = "required"
          + instance_metadata_tags      = "enabled"
        }

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 30
          + volume_type           = (known after apply)
        }
    }

  # module.server.aws_security_group.ec2 will be created
  + resource "aws_security_group" "ec2" {
      + arn                    = (known after apply)
      + description            = "EC2 Security Group for serving WordPress content"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "The instance can communicate outbound with all ports and IPs"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Open port HTTP for the website"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Open port HTTP for the website"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "116.240.106.36/32",
                ]
              + description      = "Open port SSH for the website to personal IP"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "example-default-ec2-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
          + "Application" = "example"
          + "Created_By"  = "Terraform"
          + "Description" = "Wordpress website hosted in EC2"
          + "Environment" = "default"
          + "Name"        = "example-default"
          + "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"        = "Business"
        }
      + tags_all               = {
          + "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
          + "Application" = "example"
          + "Created_By"  = "Terraform"
          + "Description" = "Wordpress website hosted in EC2"
          + "Environment" = "default"
          + "Name"        = "example-default"
          + "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"        = "Business"
        }
      + vpc_id                 = (known after apply)
    }

  # module.load_balancer.module.alb.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.load_balancer.module.alb.aws_lb.this[0] will be created
  + resource "aws_lb" "this" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = true
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = (known after apply)
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "example-default-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "AMI_Repo"              = "https://github.com/tlabsau/image-wordpress"
          + "Application"           = "example"
          + "Created_By"            = "Terraform"
          + "Description"           = "Wordpress website hosted in EC2"
          + "Environment"           = "default"
          + "Name"                  = "example-default"
          + "Repository"            = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"                  = "Business"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                                                     = {
          + "AMI_Repo"              = "https://github.com/tlabsau/image-wordpress"
          + "Application"           = "example"
          + "Created_By"            = "Terraform"
          + "Description"           = "Wordpress website hosted in EC2"
          + "Environment"           = "default"
          + "Name"                  = "example-default"
          + "Repository"            = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"                  = "Business"
          + "terraform-aws-modules" = "alb"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)

      + timeouts {}
    }

  # module.load_balancer.module.alb.aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Security group for example-default-alb application load balancer"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "example-default-alb-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "AMI_Repo"              = "https://github.com/tlabsau/image-wordpress"
          + "Application"           = "example"
          + "Created_By"            = "Terraform"
          + "Description"           = "Wordpress website hosted in EC2"
          + "Environment"           = "default"
          + "Name"                  = "example-default"
          + "Repository"            = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"                  = "Business"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all               = {
          + "AMI_Repo"              = "https://github.com/tlabsau/image-wordpress"
          + "Application"           = "example"
          + "Created_By"            = "Terraform"
          + "Description"           = "Wordpress website hosted in EC2"
          + "Environment"           = "default"
          + "Name"                  = "example-default"
          + "Repository"            = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"                  = "Business"
          + "terraform-aws-modules" = "alb"
        }
      + vpc_id                 = (known after apply)
    }

  # module.network.module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
          + "Application" = "example"
          + "Created_By"  = "Terraform"
          + "Description" = "Wordpress website hosted in EC2"
          + "Environment" = "default"
          + "Name"        = "example-default"
          + "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"        = "Business"
        }
      + tags_all               = {
          + "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
          + "Application" = "example"
          + "Created_By"  = "Terraform"
          + "Description" = "Wordpress website hosted in EC2"
          + "Environment" = "default"
          + "Name"        = "example-default"
          + "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"        = "Business"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + egress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + ingress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
    }

  # module.network.module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
          + "Application" = "example"
          + "Created_By"  = "Terraform"
          + "Description" = "Wordpress website hosted in EC2"
          + "Environment" = "default"
          + "Name"        = "example-default"
          + "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"        = "Business"
        }
      + tags_all               = {
          + "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
          + "Application" = "example"
          + "Created_By"  = "Terraform"
          + "Description" = "Wordpress website hosted in EC2"
          + "Environment" = "default"
          + "Name"        = "example-default"
          + "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"        = "Business"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.network.module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
          + "Application" = "example"
          + "Created_By"  = "Terraform"
          + "Description" = "Wordpress website hosted in EC2"
          + "Environment" = "default"
          + "Name"        = "example-default"
          + "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"        = "Business"
        }
      + tags_all               = {
          + "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
          + "Application" = "example"
          + "Created_By"  = "Terraform"
          + "Description" = "Wordpress website hosted in EC2"
          + "Environment" = "default"
          + "Name"        = "example-default"
          + "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"        = "Business"
        }
      + vpc_id                 = (known after apply)
    }

  # module.network.module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
          + "Application" = "example"
          + "Created_By"  = "Terraform"
          + "Description" = "Wordpress website hosted in EC2"
          + "Environment" = "default"
          + "Name"        = "example-default"
          + "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"        = "Business"
        }
      + tags_all = {
          + "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
          + "Application" = "example"
          + "Created_By"  = "Terraform"
          + "Description" = "Wordpress website hosted in EC2"
          + "Environment" = "default"
          + "Name"        = "example-default"
          + "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"        = "Business"
        }
      + vpc_id   = (known after apply)
    }

  # module.network.module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.network.module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
          + "Application" = "example"
          + "Created_By"  = "Terraform"
          + "Description" = "Wordpress website hosted in EC2"
          + "Environment" = "default"
          + "Name"        = "example-default"
          + "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"        = "Business"
        }
      + tags_all         = {
          + "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
          + "Application" = "example"
          + "Created_By"  = "Terraform"
          + "Description" = "Wordpress website hosted in EC2"
          + "Environment" = "default"
          + "Name"        = "example-default"
          + "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"        = "Business"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
          + "Application" = "example"
          + "Created_By"  = "Terraform"
          + "Description" = "Wordpress website hosted in EC2"
          + "Environment" = "default"
          + "Name"        = "example-default"
          + "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"        = "Business"
        }
      + tags_all         = {
          + "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
          + "Application" = "example"
          + "Created_By"  = "Terraform"
          + "Description" = "Wordpress website hosted in EC2"
          + "Environment" = "default"
          + "Name"        = "example-default"
          + "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"        = "Business"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
          + "Application" = "example"
          + "Created_By"  = "Terraform"
          + "Description" = "Wordpress website hosted in EC2"
          + "Environment" = "default"
          + "Name"        = "example-default"
          + "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"        = "Business"
        }
      + tags_all         = {
          + "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
          + "Application" = "example"
          + "Created_By"  = "Terraform"
          + "Description" = "Wordpress website hosted in EC2"
          + "Environment" = "default"
          + "Name"        = "example-default"
          + "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"        = "Business"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-4a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/27"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
          + "Application" = "example"
          + "Created_By"  = "Terraform"
          + "Description" = "Wordpress website hosted in EC2"
          + "Environment" = "default"
          + "Name"        = "example-default"
          + "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"        = "Business"
        }
      + tags_all                                       = {
          + "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
          + "Application" = "example"
          + "Created_By"  = "Terraform"
          + "Description" = "Wordpress website hosted in EC2"
          + "Environment" = "default"
          + "Name"        = "example-default"
          + "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"        = "Business"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-4b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.32/27"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
          + "Application" = "example"
          + "Created_By"  = "Terraform"
          + "Description" = "Wordpress website hosted in EC2"
          + "Environment" = "default"
          + "Name"        = "example-default"
          + "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"        = "Business"
        }
      + tags_all                                       = {
          + "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
          + "Application" = "example"
          + "Created_By"  = "Terraform"
          + "Description" = "Wordpress website hosted in EC2"
          + "Environment" = "default"
          + "Name"        = "example-default"
          + "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"        = "Business"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-4a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.64/27"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
          + "Application" = "example"
          + "Created_By"  = "Terraform"
          + "Description" = "Wordpress website hosted in EC2"
          + "Environment" = "default"
          + "Name"        = "example-default"
          + "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"        = "Business"
        }
      + tags_all                                       = {
          + "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
          + "Application" = "example"
          + "Created_By"  = "Terraform"
          + "Description" = "Wordpress website hosted in EC2"
          + "Environment" = "default"
          + "Name"        = "example-default"
          + "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"        = "Business"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-4b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.96/27"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
          + "Application" = "example"
          + "Created_By"  = "Terraform"
          + "Description" = "Wordpress website hosted in EC2"
          + "Environment" = "default"
          + "Name"        = "example-default"
          + "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"        = "Business"
        }
      + tags_all                                       = {
          + "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
          + "Application" = "example"
          + "Created_By"  = "Terraform"
          + "Description" = "Wordpress website hosted in EC2"
          + "Environment" = "default"
          + "Name"        = "example-default"
          + "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"        = "Business"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/24"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
          + "Application" = "example"
          + "Created_By"  = "Terraform"
          + "Description" = "Wordpress website hosted in EC2"
          + "Environment" = "default"
          + "Name"        = "example-default"
          + "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"        = "Business"
        }
      + tags_all                             = {
          + "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
          + "Application" = "example"
          + "Created_By"  = "Terraform"
          + "Description" = "Wordpress website hosted in EC2"
          + "Environment" = "default"
          + "Name"        = "example-default"
          + "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
          + "Type"        = "Business"
        }
    }

Plan: 37 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + app_files_bucket  = "example-default-app-files"
  + bucket_arn        = (known after apply)
  + public_subnet_ids = [
      + (known after apply),
      + (known after apply),
    ]
  + vpc_id            = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @tarekmulla, Action: `pull_request`, Workflow: `Terraform Check`*